# St7GetFreeNodes

Returns the display option for free nodes.

Strand7 API Manual

long St7GetFreeNodes(long uID, long* Style)

Input Parameters

uID

Strand7 model file ID.

Output Parameters

Style

One of nsFreeNodeAll, nsFreeNodeNone, nsFreeNodeGroup or nsFreeNodeGroupFree.